; domain
(define (domain liftedtcore_blocksworld-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :action-costs)
 (:types block)
 (:constants
   yellow_block_1 brown_block_1 black_block_1 purple_block_2 - block
 )
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block) (hold_0) (seen_psi_1) (hold_2) (hold_3))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty) (or (not (and (ontable black_block_1) (not (= ?obj black_block_1)))) (seen_psi_1)))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (when (and (ontable black_block_1) (not (= ?obj black_block_1))) (hold_0)) (when (or (not (and (clear yellow_block_1) (not (= ?obj yellow_block_1)))) (not (and (ontable brown_block_1) (not (= ?obj brown_block_1))))) (seen_psi_1)) (when (or (= ?obj brown_block_1) (holding brown_block_1)) (hold_3)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj) (or (not (or (= ?obj black_block_1) (ontable black_block_1))) (seen_psi_1)))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (when (or (= ?obj black_block_1) (ontable black_block_1)) (hold_0)) (when (or (not (or (= ?obj yellow_block_1) (clear yellow_block_1))) (not (or (= ?obj brown_block_1) (ontable brown_block_1)))) (seen_psi_1)) (when (and (holding brown_block_1) (not (= ?obj brown_block_1))) (hold_3)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (when (or (not (or (= ?obj yellow_block_1) (and (clear yellow_block_1) (not (= ?underobj yellow_block_1))))) (not (ontable brown_block_1))) (seen_psi_1)) (when (or (and (= ?obj purple_block_2) (= ?underobj black_block_1)) (on purple_block_2 black_block_1)) (hold_2)) (when (and (holding brown_block_1) (not (= ?obj brown_block_1))) (hold_3)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (when (or (not (or (= ?underobj yellow_block_1) (and (clear yellow_block_1) (not (= ?obj yellow_block_1))))) (not (ontable brown_block_1))) (seen_psi_1)) (when (and (on purple_block_2 black_block_1) (not (and (= ?obj purple_block_2) (= ?underobj black_block_1)))) (hold_2)) (when (or (= ?obj brown_block_1) (holding brown_block_1)) (hold_3)) (increase (total-cost) 1)))
)

; problem
(define (problem liftedtcore_blocksworld-problem)
 (:domain liftedtcore_blocksworld-domain)
 (:objects
   purple_block_1 - block
 )
 (:init (ontable purple_block_1) (ontable brown_block_1) (on yellow_block_1 brown_block_1) (on purple_block_2 purple_block_1) (on black_block_1 purple_block_2) (clear yellow_block_1) (clear black_block_1) (handempty) (= (total-cost) 0))
 (:goal (and (clear purple_block_1) (hold_0) (hold_2) (hold_3)))
 (:metric minimize (total-cost))
)

; plan
1. (unstack yellow_block_1 brown_block_1)
   deleted: (on yellow_block_1 brown_block_1) (clear yellow_block_1) (handempty)
   added: (holding yellow_block_1) (clear brown_block_1) (seen_psi_1)
   goals met: 0 of 4
2. (putdown yellow_block_1)
   deleted: (holding yellow_block_1)
   added: (clear yellow_block_1) (handempty) (ontable yellow_block_1)
   goals met: 0 of 4
3. (unstack black_block_1 purple_block_2)
   deleted: (on black_block_1 purple_block_2) (clear black_block_1) (handempty)
   added: (holding black_block_1) (clear purple_block_2)
   goals met: 0 of 4
4. (putdown black_block_1)
   deleted: (holding black_block_1)
   added: (clear black_block_1) (handempty) (ontable black_block_1) (hold_0)
   goals met: 1 of 4
5. (unstack purple_block_2 purple_block_1)
   deleted: (on purple_block_2 purple_block_1) (clear purple_block_2) (handempty)
   added: (holding purple_block_2) (clear purple_block_1)
   goals met: 2 of 4
6. (stack purple_block_2 black_block_1)
   deleted: (clear black_block_1) (holding purple_block_2)
   added: (handempty) (clear purple_block_2) (on purple_block_2 black_block_1) (hold_2)
   goals met: 3 of 4
7. (pickup brown_block_1)
   deleted: (clear brown_block_1) (ontable brown_block_1) (handempty)
   added: (holding brown_block_1) (hold_3)
   goals met: 4 of 4
